src/cf/Documents/Спринт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Спринт</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СпринтыПоСделкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияСпринта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставСпринта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланНаНеделю</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактПоИтогамНедели</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическийСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделали</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучилиЖелаемыйРезультат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выводы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/СпринтыПоСделкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СпринтыПоСделкам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сделали</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершенияСпринта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучилиЖелаемыйРезультат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПланНаНеделю</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактПоИтогамНедели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выводы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/Спринт/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
//<<Ермеев проверка на созаданный ранее документ на этой неделе

	ТекущаяНеделя = НеделяГода(ТекущаяДата()); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпринтыПоСделкамСрезПоследних.Ответственный КАК Ответственный,
		|	НЕДЕЛЯ(СпринтыПоСделкамСрезПоследних.Регистратор.Дата) КАК Неделя
		|ИЗ
		|	РегистрСведений.СпринтыПоСделкам.СрезПоследних(, НЕДЕЛЯ(Регистратор.Дата) = &Неделя) КАК СпринтыПоСделкамСрезПоследних
		|ГДЕ
		|	СпринтыПоСделкамСрезПоследних.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("Неделя", ТекущаяНеделя);
	ЗАпрос.УстановитьПараметр("Ответственный",Ответственный);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если НЕ РезультатЗапроса.Пустой()  Тогда
		Сообщить("На этой неделе менеджер "  + Ответственный + " уже создавал документ!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
//>>

	
	
//<<Ермеев запись в регистр сведений
		Движения.СпринтыПоСделкам.Записывать = Истина;
	Для Каждого ТекСтрокаСоставСпринта Из СоставСпринта Цикл
		Движение = Движения.СпринтыПоСделкам.Добавить();
		Движение.Период = Дата;
		Движение.ДатаЗавершенияСпринта = ДатаЗавершенияСпринта;
		Движение.Сделка = ТекСтрокаСоставСпринта.Сделка;
		Движение.Клиент = ТекСтрокаСоставСпринта.Клиент;
		Движение.Ответственный = Ответственный;
		
		Если ТекСтрокаСоставСпринта.ФактическийСтатус.Пустая() Тогда
			Движение.ФактическийСтатус = ТекСтрокаСоставСпринта.ФактическийСтатус;
			Движение.ТекущийСтатус = ТекСтрокаСоставСпринта.ТекущийСтатус;
			Движение.НовыйСтатус = ТекСтрокаСоставСпринта.НовыйСтатус;
			Движение.Сделали = ТекСтрокаСоставСпринта.Сделали;
			Движение.ПланНаНеделю = ТекСтрокаСоставСпринта.ПланНаНеделю;
			Движение.ФактПоИтогамНедели = ТекСтрокаСоставСпринта.ФактПоИтогамНедели;
			Движение.ПолучилиЖелаемыйРезультат = ТекСтрокаСоставСпринта.ПолучилиЖелаемыйРезультат;
			Движение.Выводы = ТекСтрокаСоставСпринта.Выводы;	
		Иначе
			Движение.ТекущийСтатус = ТекСтрокаСоставСпринта.ФактическийСтатус;
			Движение.ФактическийСтатус = "";
			Движение.НовыйСтатус = "";
			Движение.Сделали = "";
			Движение.ПланНаНеделю = "" ;
			Движение.ФактПоИтогамНедели = "";
			Движение.ПолучилиЖелаемыйРезультат = "" ;
			Движение.Выводы = "";
		КонецЕсли
		
	КонецЦикла;
//>>
	КонецПроцедуры
